package ru.rouge.sleeper.Map;

/**
 * Created by Evgenij on 09.09.13.
 *
 * Элемент карты проходимостей: будет содержать указатель на массив объектов + переменная проходимости
 */
public class PhysicMapCell
{
    //-----------------------------
    //Constants
    //-----------------------------

    //-----------------------------
    //Variables
    //-----------------------------

    public boolean isWalkable;
    public int mIndexObject;

    //-----------------------------
    //Ctors
    //-----------------------------

    //-----------------------------
    //Methods
    //-----------------------------

    //-----------------------------
    //Getters/Setters
    //-----------------------------

    //-----------------------------
    //Inner Classes
    //-----------------------------
}
